src/cf/InformationRegisters/ЗаказыТорговыхПлощадок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗаказыТорговыхПлощадок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиМаркетплейсов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовТорговыхПлощадок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПлановойОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСкладаТорговойПлощадки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРодительскогоОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСкладаТорговойПлощадки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяЗаполнениеСведенийПоТоварам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПолучениеЭтикеток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаданияПолученияЭтикеток</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОтгрузки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ДополнительныеСведенияПоТоварамЗаказовТорговыхПлощадок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеСведенияПоТоварамЗаказовТорговыхПлощадок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТребуетсяСтранаПроисхождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяНомерГТД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяРНПТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяМаркировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяУИН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихкодУпаковки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйКодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРодительскогоОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОтгрузки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаПройдена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭкземпляра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СтатусыЗаказовТорговыхПлощадок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовТорговыхПлощадок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетСборки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятВДоставку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставляется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПунктеВыдачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/СтраныМира.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СтраныМира</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАльфа2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАльфа3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчастникЕАЭС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ЗаказыТорговыхПлощадок/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет указать объекты метаданных, для которых задана логика ограничения доступа к данным.
//
// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(УчетнаяЗапись.Организация)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Проверяет заказ и возвращает сведения по отправлениям.
//
// Параметры:
//   Заказы                              - Массив из ДокументСсылка.ЗаказПокупателя - проверяемый заказ.
//   РезультатПроверкиЗаказов            - Соответствие из см. ИнтеграцияСМаркетплейсамиКлиентСервер.РезультатПроверкиЗаказа -
//                                       - Неопределено - результат проверки заказов. 
//   ЗаполнитьДанныеПоНомерамОтправлений - Булево - признак заполнения данных по отправлениям.
//   ЗаполнитьСведенияОбЭкземплярах      - Булево - признак заполнения данных по экземплярам.
//
// Возвращаемое значение:
//   Соответствие из см. ИнтеграцияСМаркетплейсамиКлиентСервер.РезультатПроверкиЗаказа.
//
Функция ПроверитьЗаказы(Заказы, РезультатПроверкиЗаказов = Неопределено,
			ЗаполнитьДанныеПоНомерамОтправлений = Ложь, ЗаполнитьСведенияОбЭкземплярах = Ложь) Экспорт

	Если РезультатПроверкиЗаказов = Неопределено Тогда
		РезультатПроверкиЗаказов = Новый Соответствие;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(Заказы, Документы.ЗаказПокупателя.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПроверкиЗаказов(ЗаполнитьСведенияОбЭкземплярах);
	Запрос.УстановитьПараметр("Заказы", Заказы);
	
	УстановитьПривилегированныйРежим(Истина);
	ПакетЗапроса = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	ВыборкаОтправленийСНезаполненнымиДанными = ПакетЗапроса[ПакетЗапроса.ВГраница() - 1].Выбрать();
	Пока ВыборкаОтправленийСНезаполненнымиДанными.Следующий() Цикл
		РезультатПроверкиЗаказа = ИнтеграцияСМаркетплейсамиКлиентСервер.РезультатПроверкиЗаказа(
			ВыборкаОтправленийСНезаполненнымиДанными.Заказ,
			РезультатПроверкиЗаказов);
		РезультатПроверкиЗаказа.ОтправленияСНезаполненнымиДанными.Добавить(ВыборкаОтправленийСНезаполненнымиДанными.НомерОтправления);
	КонецЦикла;
	
	ВыборкаОтправленийИзмененных = ПакетЗапроса[ПакетЗапроса.ВГраница() - 3].Выбрать();
	Пока ВыборкаОтправленийИзмененных.Следующий() Цикл
		РезультатПроверкиЗаказа = ИнтеграцияСМаркетплейсамиКлиентСервер.РезультатПроверкиЗаказа(
			ВыборкаОтправленийИзмененных.Заказ,
			РезультатПроверкиЗаказов);
		РезультатПроверкиЗаказа.ОтправленияИзмененные.Добавить(ВыборкаОтправленийИзмененных.НомерОтправления);
		
		Если ЗначениеЗаполнено(ВыборкаОтправленийИзмененных.ДокументОтгрузки) Тогда
			РезультатПроверкиЗаказа.ИзмененныеДокументыОтгрузки.Вставить(ВыборкаОтправленийИзмененных.ДокументОтгрузки,
				ВыборкаОтправленийИзмененных.НомерОтправления);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗаполнитьДанныеПоНомерамОтправлений Тогда
		КлючиДанныхДляЗаписи = КлючиДанныхДляЗаписиЗаказаТорговойПлощадки();
	КонецЕсли;
	
	СтатусОжидаетСборки = Перечисления.СтатусыЗаказовТорговыхПлощадок.ОжидаетСборки;
	СтатусОтменен       = Перечисления.СтатусыЗаказовТорговыхПлощадок.Отменен;
	
	ВыборкаЗаказов = ПакетЗапроса[ПакетЗапроса.ВГраница() - 5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЗаказов.Следующий() Цикл
		РезультатПроверкиЗаказа = ИнтеграцияСМаркетплейсамиКлиентСервер.РезультатПроверкиЗаказа(ВыборкаЗаказов.Заказ, РезультатПроверкиЗаказов);
		РезультатПроверкиЗаказа.ХозяйственнаяОперация = ВыборкаЗаказов.ХозяйственнаяОперация;
		РезультатПроверкиЗаказа.УчетнаяЗапись         = ВыборкаЗаказов.УчетнаяЗапись;
		РезультатПроверкиЗаказа.ВидМаркетплейса       = ВыборкаЗаказов.ВидМаркетплейса;
		
		ВыборкаОтправлений = ВыборкаЗаказов.Выбрать();
		Пока ВыборкаОтправлений.Следующий() Цикл
			РезультатПроверкиЗаказа.МаксимальныйИдентификаторЭкземпляра =
				Макс(РезультатПроверкиЗаказа.МаксимальныйИдентификаторЭкземпляра,
					ВыборкаОтправлений.МаксимальныйИдентификаторЭкземпляра);
			
			Если ВыборкаОтправлений.Статус <> СтатусОжидаетСборки Тогда
				РезультатПроверкиЗаказа.ОтправленияНеВСборке.Добавить(ВыборкаОтправлений.НомерОтправления);
				
				Если ВыборкаОтправлений.Статус = СтатусОтменен Тогда
					РезультатПроверкиЗаказа.ОтправленияОтмененные.Добавить(ВыборкаОтправлений.НомерОтправления);
				КонецЕсли;
			Иначе
				РезультатПроверкиЗаказа.ОтправленияВСборке.Добавить(ВыборкаОтправлений.НомерОтправления);
				
				Если ВыборкаОтправлений.КоличествоЗаписей = 0 Тогда
					РезультатПроверкиЗаказа.ОтправленияБезТоваров.Добавить(ВыборкаОтправлений.НомерОтправления);
				ИначеЕсли ВыборкаОтправлений.КоличествоПеренесенныхПозиций > 0 Тогда
					РезультатПроверкиЗаказа.ОтправленияИзмененные.Добавить(ВыборкаОтправлений.НомерОтправления);
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(ВыборкаОтправлений.ДокументОтгрузки) Тогда
					РезультатПроверкиЗаказа.ОтправленияБезДокументовОтгрузки.Добавить(ВыборкаОтправлений.НомерОтправления);
				КонецЕсли;
			КонецЕсли;
			
			Если ЗаполнитьДанныеПоНомерамОтправлений Тогда
				ДанныеОтправления = Новый Структура(КлючиДанныхДляЗаписи);
				ЗаполнитьЗначенияСвойств(ДанныеОтправления, ВыборкаОтправлений);
				РезультатПроверкиЗаказа.ДанныеПоНомерамОтправлений.Вставить(ВыборкаОтправлений.НомерОтправления, ДанныеОтправления);
			КонецЕсли;
		КонецЦикла;
		
		РезультатПроверкиЗаказа.ОтправленияИзмененные =
			ОбщегоНазначенияКлиентСервер.СвернутьМассив(РезультатПроверкиЗаказа.ОтправленияИзмененные);
		
		ПроверитьГотовностьОтправленийКПодтверждениюСборки(РезультатПроверкиЗаказа);
	КонецЦикла;
	
	Если ЗаполнитьСведенияОбЭкземплярах Тогда
		ВыборкаЗаказов = ПакетЗапроса[ПакетЗапроса.ВГраница() - 8].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЗаказов.Следующий() Цикл
			РезультатПроверкиЗаказа = ИнтеграцияСМаркетплейсамиКлиентСервер.РезультатПроверкиЗаказа(
				ВыборкаЗаказов.Заказ,
				РезультатПроверкиЗаказов);
			
			ВыборкаЭкземпляров = ВыборкаЗаказов.Выбрать();
			Пока ВыборкаЭкземпляров.Следующий() Цикл
				РезультатПроверкиЗаказа.ЭкземплярыБезДокументовОтгрузки.Добавить(ВыборкаЭкземпляров.ИдентификаторЭкземпляра);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Возврат РезультатПроверкиЗаказов;

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаСписка" Тогда
		Если Параметры.Свойство("ФиксированныеНастройки") Тогда
			ЭлементыОтбора = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(Параметры.ФиксированныеНастройки.Отбор, "УчетнаяЗапись");
			Если ЭлементыОтбора.Количество() > 0
					И ЭлементыОтбора[0].Использование Тогда
				ДанныеТорговойПлощадки = Справочники.УчетныеЗаписиМаркетплейсов.НастройкиУчетнойЗаписи(ЭлементыОтбора[0].ПравоеЗначение);
				
				Параметры.Вставить("УчетнаяЗапись",               ЭлементыОтбора[0].ПравоеЗначение);
				Параметры.Вставить("КлючНазначенияИспользования", "FBS" + ДанныеТорговойПлощадки.ИдентификаторКлиента);
				
				ВыбраннаяФорма       = "РегистрСведений.ЗаказыТорговыхПлощадок.Форма.ФормаСпискаЗаказов";
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает постфикс для формирования нового временного номера отправления.
//
// Возвращаемое значение:
//   Строка - постфикс отправления.
//
Функция ПостфиксНовогоОтправления() Экспорт

	Возврат "-Новое";

КонецФункции

// Генерирует номер нового отправления по номеру заказа.
//
// Параметры:
//   НомерЗаказа                   - Строка - номер заказа по данным торговой площадки.
//   КоличествоОтправленийПоЗаказу - Число - количество номеров отправлений по заказу.
//
// Возвращаемое значение:
//   Строка - номер нового отправления.
//
Функция НомерНовогоОтправления(НомерЗаказа, КоличествоОтправленийПоЗаказу) Экспорт

	НомерОтправления = НомерЗаказа + ПостфиксНовогоОтправления()
		+ Формат(КоличествоОтправленийПоЗаказу + 1, "ЧГ=");
	
	Возврат НомерОтправления;

КонецФункции

// Выделяет из номера отправления порядковый номер.
// Если отправление без ПостфиксНовогоОтправления(), возвращается 0.
//
// Параметры:
//   НомерОтправления - Строка - номер отправления.
//
// Возвращаемое значение:
//   Число - порядковый номер отправления.
//
Функция ПорядковыйНомерНовогоОтправления(Знач НомерОтправления) Экспорт

	Постфикс = ПостфиксНовогоОтправления();
	
	Позиция = СтрНайти(НомерОтправления, Постфикс);
	Если Позиция = 0 Тогда
		ПорядковыйНомер = 0;
	Иначе
		НомерОтправления = Сред(НомерОтправления, Позиция);
		НомерОтправления = СтрЗаменить(НомерОтправления, Постфикс, "");
		
		ПорядковыйНомер = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(НомерОтправления);
	КонецЕсли;
	
	Возврат ПорядковыйНомер;

КонецФункции

// Возвращает ключи записи регистра заказов торговых площадок.
//
// Возвращаемое значение:
//   Строка - строка, содержащая поля РегистрСведений.ЗаказыТорговыхПлощадок.
//
Функция КлючиДанныхДляЗаписиЗаказаТорговойПлощадки() Экспорт

	СтруктураПоМенеджеруЗаписи = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(
		Новый Соответствие,
		Метаданные.РегистрыСведений.ЗаказыТорговыхПлощадок);
	
	КлючиДанныхДляЗаписи = ОбщегоНазначенияКлиентСервер.КлючиСтруктурыВСтроку(СтруктураПоМенеджеруЗаписи, ",");
	
	КлючиДанныхДляЗаписи = КлючиДанныхДляЗаписи + ",ДатаДокументаОтгрузки,НомерДокументаОтгрузки";
	
	Возврат КлючиДанныхДляЗаписи;

КонецФункции


// Актуализирует состав записей регистра РегистрыСведений.ЗаказыТорговыхПлощадок.
//
// Параметры:
//   Заказ                      - ДокументСсылка.ЗаказПокупателя - заказ для обновления сведений об отправлениях.
//   ДанныеПоНомерамОтправлений - Соответствие из КлючИЗначение - список номеров отправлений и документов отгрузки,
//                                   где ключ - номер отправления, значение - структура из состава полей
//                                   регистра РегистрыСведений.ЗаказыТорговыхПлощадок.
//
// Возвращаемое значение:
//   Строка - текст ошибки.
//
Функция ЗаписатьСведенияОбОтправлениях(Заказ, ДанныеПоНомерамОтправлений) Экспорт

	ТекстОшибки = "";
	
	Если Не ЗначениеЗаполнено(ДанныеПоНомерамОтправлений) Тогда
		Возврат ТекстОшибки;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных =
			БлокировкаДанных.Добавить("РегистрСведений.ЗаказыТорговыхПлощадок");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Разделяемый;
		ЭлементБлокировкиДанных.УстановитьЗначение("Заказ", Заказ);
		БлокировкаДанных.Заблокировать();
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Заказ.Установить(Заказ);
		НаборЗаписей.Прочитать();
		
		ЗаписиКУдалению = Новый Массив;
		
		Для Каждого Запись Из НаборЗаписей Цикл
			ДанныеПоНомеруОтправления = ДанныеПоНомерамОтправлений[Запись.НомерОтправления];
			Если ДанныеПоНомеруОтправления = Неопределено Тогда
				ЗаписиКУдалению.Добавить(Запись);
			Иначе
				Запись.ДокументОтгрузки              = ДанныеПоНомеруОтправления.ДокументОтгрузки;
				Запись.НомерРодительскогоОтправления = ДанныеПоНомеруОтправления.НомерРодительскогоОтправления;
				ДанныеПоНомерамОтправлений.Удалить(Запись.НомерОтправления);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Запись Из ЗаписиКУдалению Цикл
			НаборЗаписей.Удалить(Запись);
		КонецЦикла;
		
		Для Каждого ДанныеПоНомеруОтправления Из ДанныеПоНомерамОтправлений Цикл
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, ДанныеПоНомеруОтправления.Значение);
			
			Запись.НомерОтправления     = ДанныеПоНомеруОтправления.Ключ;
			Запись.Статус               = Перечисления.СтатусыЗаказовТорговыхПлощадок.ОжидаетСборки;
			Запись.ДатаУстановкиСтатуса = ТекущаяДатаСеанса();
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось записать данные по номерам отправлений для заказа %1 по причине: %2.'"),
			Заказ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТекстОшибки;

КонецФункции

// Устанавливает статус заказа.
//
// Параметры:
//   Заказ                        - ДокументСсылка.ЗаказПокупателя - заказ, для которого изменяется статус.
//   ДокументОтгрузки             - ДокументСсылка.РасходнаяНакладная - документ отгрузки.
//   Статус                       - ПеречислениеСсылка.СтатусыЗаказовТорговыхПлощадок - устанавливаемый статус.
//   ИмяСобытияЖурналаРегистрации - Строка - см. ИнтеграцияСМаркетплейсамиСервер.СобытиеЖурналаРегистрации().
//
// Возвращаемое значение:
//   Булево - признак успешного выполнения.
//
Функция УстановитьСтатус(Заказ, ДокументОтгрузки, Статус, ИмяСобытияЖурналаРегистрации = "") Экспорт
	
	Если ПустаяСтрока(ИмяСобытияЖурналаРегистрации) Тогда
		ИмяСобытияЖурналаРегистрации = ИнтеграцияСМаркетплейсомOzonСервер.СобытиеЖурналаРегистрации();
	КонецЕсли;
	
	ВыполненоУспешно = Истина;
	
	НачатьТранзакцию();
	
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ЗаказыТорговыхПлощадок");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Разделяемый;
		ЭлементБлокировкиДанных.УстановитьЗначение("Заказ",            Заказ);
		ЭлементБлокировкиДанных.УстановитьЗначение("ДокументОтгрузки", ДокументОтгрузки);
		БлокировкаДанных.Заблокировать();
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Заказ.Установить(Заказ);
		НаборЗаписей.Отбор.ДокументОтгрузки.Установить(ДокументОтгрузки);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0 Тогда
			НаборЗаписей[0].Статус                     = Статус;
			НаборЗаписей[0].ДатаУстановкиСтатуса       = ТекущаяДатаСеанса();
			НаборЗаписей[0].ТребуетсяПолучениеЭтикеток = (НаборЗаписей[0].Статус = Перечисления.СтатусыЗаказовТорговыхПлощадок.ГотовКОтгрузке);
			
			НаборЗаписей.Записать(Истина);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВыполненоУспешно = Ложь;
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'При установке статуса заказа <%1> возникла ошибка: %2.'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			Заказ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации,
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстОшибки);
	КонецПопытки;
	
	Возврат ВыполненоУспешно;
	
КонецФункции

// Устанавливает статус отправления заказа.
//
// Параметры:
//   Заказ            - ДокументСсылка.ЗаказПокупателя - заказ.
//   НомерОтправления - Строка - номер отправления по данным учетной системы.
//   Статус           - ПеречислениеСсылка.СтатусыЗаказовТорговыхПлощадок - устанавливаемый статус.
//   ИмяСобытия       - см. ИнтеграцияСМаркетплейсамиСервер.СобытиеЖурналаРегистрации.
//
// Возвращаемое значение:
//   Строка - текст ошибки.
//
Функция УстановитьСтатусОтправления(Заказ, НомерОтправления, Статус, ИмяСобытия = "") Экспорт

	ТекстОшибки = "";
	НачатьТранзакцию();
	
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных =
		БлокировкаДанных.Добавить("РегистрСведений.ЗаказыТорговыхПлощадок");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Разделяемый;
		ЭлементБлокировкиДанных.УстановитьЗначение("Заказ", Заказ);
		БлокировкаДанных.Заблокировать();
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Заказ.Установить(Заказ);
		НаборЗаписей.Прочитать();
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Если Запись.НомерОтправления = НомерОтправления Тогда
				Запись.Статус                     = Статус;
				Запись.ДатаУстановкиСтатуса       = ТекущаяДатаСеанса();
				Запись.ТребуетсяПолучениеЭтикеток = (НаборЗаписей[0].Статус = Перечисления.СтатусыЗаказовТорговыхПлощадок.ГотовКОтгрузке);
			КонецЕсли;
		КонецЦикла;
		
		НаборЗаписей.Записать();
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось изменить статус заказа <%1> по отправлению <%2> по причине: %3.'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			Заказ,
			НомерОтправления,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			
		ЗаписьЖурналаРегистрации(ИмяСобытия,
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстОшибки);
	КонецПопытки;
	
	Возврат ТекстОшибки;

КонецФункции

// Заменяет номер отправления для заказа после подтверждения сборки выделенных товаров.
//
// Параметры:
//   Заказ                 - ДокументСсылка.ЗаказПокупателя - заказ.
//   НомерОтправления      - Строка - номер отправления по данным учетной системы.
//   НовыйНомерОтправления - Строка - номер отправления по данным торговой площадки.
//   Статус                - Неопределено, ПеречислениеСсылка.СтатусыЗаказовТорговыхПлощадок - устанавливаемый статус.
//   ИмяСобытия            - см. ИнтеграцияСМаркетплейсамиСервер.СобытиеЖурналаРегистрации.
//
// Возвращаемое значение:
//   Строка - текст ошибки.
//
Функция ЗаменитьНомерОтправления(Заказ, НомерОтправления, НовыйНомерОтправления, Статус = Неопределено, ИмяСобытия = "") Экспорт

	ТекстОшибки = "";
	НачатьТранзакцию();
	
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных =
		БлокировкаДанных.Добавить("РегистрСведений.ЗаказыТорговыхПлощадок");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Разделяемый;
		ЭлементБлокировкиДанных.УстановитьЗначение("Заказ", Заказ);
		БлокировкаДанных.Заблокировать();
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Заказ.Установить(Заказ);
		НаборЗаписей.Прочитать();
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Если Запись.НомерОтправления = НомерОтправления Тогда
				Запись.НомерОтправления = НовыйНомерОтправления;
				
				Если Статус <> Неопределено Тогда
					Запись.Статус                     = Статус;
					Запись.ДатаУстановкиСтатуса       = ТекущаяДатаСеанса();
					Запись.ТребуетсяПолучениеЭтикеток = (НаборЗаписей[0].Статус = Перечисления.СтатусыЗаказовТорговыхПлощадок.ГотовКОтгрузке);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		НаборЗаписей.Записать();
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось изменить номер отправления с <%1> на <%2> для заказа <%3> по причине: %4.'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			НомерОтправления,
			НовыйНомерОтправления,
			Заказ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			
		ЗаписьЖурналаРегистрации(ИмяСобытия,
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстОшибки);
	КонецПопытки;
	
	Возврат ТекстОшибки;

КонецФункции

// Определяет данные регистра сведений, соответствующие условиям поиска.
//
// Параметры:
//   Заказ            - ДокументСсылка.ЗаказПокупателя, Неопределено - заказ.
//   ДокументОтгрузки - ДокументСсылка.РасходнаяНакладная - документ отгрузки.
//
// Возвращаемое значение:
//   Неопределено - при пустых значениях параметров;
//   Структура - данные регистра сведений, соответствующие условиям поиска.
//
Функция ПолучитьДанныеЗаказа(Заказ = Неопределено, ДокументОтгрузки = Неопределено) Экспорт
	
	Результат = Неопределено;
	
	Если Заказ = Неопределено
			И ДокументОтгрузки = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	*
		|ИЗ
		|	РегистрСведений.ЗаказыТорговыхПлощадок КАК ЗаказыТорговыхПлощадок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
		|		ПО ЗаказыТорговыхПлощадок.Заказ = ЗаказКлиента.Ссылка
		|ГДЕ
		|	ЗаказыТорговыхПлощадок.Заказ = &Заказ
		|	И ЗаказыТорговыхПлощадок.ДокументОтгрузки = &ДокументОтгрузки";
	
	Запрос.УстановитьПараметр("Заказ",            Заказ);
	Запрос.УстановитьПараметр("ДокументОтгрузки", ДокументОтгрузки);
	
	Если Заказ = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗаказыТорговыхПлощадок.Заказ = &Заказ", "ИСТИНА");
	КонецЕсли;
	Если ДокументОтгрузки = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗаказыТорговыхПлощадок.ДокументОтгрузки = &ДокументОтгрузки", "ИСТИНА");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДанных    = РезультатЗапроса.Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ВыборкаДанных.Следующий() Тогда
		Результат = Новый Структура;
		Для Каждого ЭлементКоллекции Из РезультатЗапроса.Колонки Цикл
			Если ЭлементКоллекции.ТипЗначения = Новый ОписаниеТипов("РезультатЗапроса") Тогда
				Продолжить;
			КонецЕсли;
			
			Результат.Вставить(ЭлементКоллекции.Имя, ВыборкаДанных[ЭлементКоллекции.Имя]);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает список недоступных к отмене заказов и их номеров отправлений.
//
// Параметры:
//   Заказы              - Массив из ДокументСсылка.ЗаказПокупателя - заказ.
//   НомераОтправлений   - Массив из Строка - номер отправления.
//   РезультатЗаполнения - Структура -
//
// Возвращаемое значение:
//   Структура - результат проверки с ключами:
//     * ИнформацияДляПользователя     - Строка - описание недоступных к отмене заказов и отправлений.
//     * НедоступныеКОтменеОтправления - Соответствие из КлючИЗначение - список недоступных к отмене заказов в ключе
//                                         и их номеров отправлений в значении.
//
Функция ПроверитьВозможностьОтменыТоваровОтправления(Заказы, НомераОтправлений, РезультатЗаполнения) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("ИнформацияДляПользователя",     "");
	Результат.Вставить("НедоступныеКОтменеОтправления", Новый Соответствие);
	
	СписокСообщений = Новый Массив;
	
	ШаблонСообщения = НСтр("ru = 'Для заказа ""%1"" уже отменены отправления: %2.'");
	
	РезультатПроверкиЗаказов = РезультатЗаполнения.РезультатПроверкиЗаказов;
	
	Если РезультатПроверкиЗаказов = Неопределено Или РезультатПроверкиЗаказов.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из РезультатПроверкиЗаказов Цикл
		Заказ = КлючИЗначение.Ключ;
		РезультатПроверкиЗаказа = КлючИЗначение.Значение;
		
		Если Не ЗначениеЗаполнено(Заказ) Тогда
			Продолжить;
		КонецЕсли;
		
		ОтправленияОтмененные = Новый Массив;
		
		Для Каждого НомерОтправления Из РезультатПроверкиЗаказа.ОтправленияОтмененные Цикл
			Индекс = НомераОтправлений.Найти(НомерОтправления);
			Если Индекс <> Неопределено Тогда
				ОтправленияОтмененные.Добавить(НомерОтправления);
				НомераОтправлений.Удалить(Индекс);
			КонецЕсли;
		КонецЦикла;
		
		Если ОтправленияОтмененные.Количество() > 0 Тогда
			СписокСообщений.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
										ШаблонСообщения,
										Заказ,
										СтрСоединить(ОтправленияОтмененные, ", ")));
		КонецЕсли;
	КонецЦикла;
	
	СведенияПоТоварам = РезультатЗаполнения.СведенияПоТоварам;
	
	Если СведенияПоТоварам = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияПоТоварам.Заказ КАК Заказ,
		|	СведенияПоТоварам.НомерОтправления КАК НомерОтправления,
		|	СведенияПоТоварам.Номенклатура КАК Номенклатура,
		|	СведенияПоТоварам.Характеристика КАК Характеристика,
		|	СведенияПоТоварам.Склад КАК Склад,
		|	СведенияПоТоварам.ИдентификаторСтрокиЗаполнен КАК ОформленДокументОтгрузки,
		|	СведенияПоТоварам.КОтгрузке КАК КОтгрузке,
		|	СведенияПоТоварам.Отменено КАК Отменено,
		|	СведенияПоТоварам.ДокументОтгрузкиКОформлению КАК ДокументОтгрузкиКОформлению,
		|	СведенияПоТоварам.Количество КАК Количество
		|ПОМЕСТИТЬ СведенияПоТоварам
		|ИЗ
		|	&СведенияПоТоварам КАК СведенияПоТоварам
		|ГДЕ
		|	СведенияПоТоварам.Заказ В(&Заказы)
		|	И СведенияПоТоварам.НомерОтправления В(&НомераОтправлений)
		|	И СведенияПоТоварам.КОтгрузке
		|	И НЕ СведенияПоТоварам.Отменено
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СведенияПоТоварам.Заказ КАК Заказ,
		|	СведенияПоТоварам.НомерОтправления КАК НомерОтправления
		|ПОМЕСТИТЬ ОтгруженныеОтправления
		|ИЗ
		|	СведенияПоТоварам КАК СведенияПоТоварам
		|ГДЕ
		|	СведенияПоТоварам.ОформленДокументОтгрузки
		|	И НЕ СведенияПоТоварам.ДокументОтгрузкиКОформлению
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтгруженныеОтправления.Заказ КАК Заказ,
		|	ОтгруженныеОтправления.НомерОтправления КАК НомерОтправления
		|ИЗ
		|	ОтгруженныеОтправления КАК ОтгруженныеОтправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияПоТоварам.Заказ КАК Заказ,
		|	СведенияПоТоварам.НомерОтправления КАК НомерОтправления,
		|	СведенияПоТоварам.Номенклатура КАК Номенклатура,
		|	СведенияПоТоварам.Характеристика КАК Характеристика,
		|	СведенияПоТоварам.Склад КАК Склад,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияПоТоварам.ДокументОтгрузкиКОформлению
		|				ТОГДА СведенияПоТоварам.Количество
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Количество
		|ИЗ
		|	СведенияПоТоварам КАК СведенияПоТоварам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОтгруженныеОтправления КАК ОтгруженныеОтправления
		|		ПО СведенияПоТоварам.Заказ = ОтгруженныеОтправления.Заказ
		|			И СведенияПоТоварам.НомерОтправления = ОтгруженныеОтправления.НомерОтправления
		|ГДЕ
		|	ОтгруженныеОтправления.НомерОтправления ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияПоТоварам.Заказ,
		|	СведенияПоТоварам.НомерОтправления,
		|	СведенияПоТоварам.Номенклатура,
		|	СведенияПоТоварам.Характеристика,
		|	СведенияПоТоварам.Склад
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВЫБОР
		|			КОГДА СведенияПоТоварам.ДокументОтгрузкиКОформлению
		|				ТОГДА СведенияПоТоварам.Количество
		|			ИНАЧЕ 0
		|		КОНЕЦ) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СведенияПоТоварам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ОтгруженныеОтправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Заказ,
		|	ТоварыКОтгрузкеОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыКОтгрузкеОстатки.Характеристика КАК Характеристика,
		|	ТоварыКОтгрузкеОстатки.Склад КАК Склад,
		|	СУММА(ТоварыКОтгрузкеОстатки.ВРезервеОстаток) КАК Зарезервировано,
		|	0 КАК ЗарезервированоОбработано,
		|	СУММА(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток - (ТоварыКОтгрузкеОстатки.КСборкеОстаток + ТоварыКОтгрузкеОстатки.СобираетсяОстаток + ТоварыКОтгрузкеОстатки.СобраноОстаток)) КАК КОтгрузкеНаСкладе,
		|	0 КАК КОтгрузкеНаСкладеОбработано,
		|	ЛОЖЬ КАК Обработана
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке.Остатки(&ТекущаяДата, ДокументОтгрузки В (&Заказы)) КАК ТоварыКОтгрузкеОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки,
		|	ТоварыКОтгрузкеОстатки.Номенклатура,
		|	ТоварыКОтгрузкеОстатки.Характеристика,
		|	ТоварыКОтгрузкеОстатки.Склад
		|
		|ИМЕЮЩИЕ
		|	СУММА(ТоварыКОтгрузкеОстатки.ВРезервеОстаток) + СУММА(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток - (ТоварыКОтгрузкеОстатки.КСборкеОстаток + ТоварыКОтгрузкеОстатки.СобираетсяОстаток + ТоварыКОтгрузкеОстатки.СобраноОстаток)) > 0";
	
	Запрос.УстановитьПараметр("ТекущаяДата",       ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Заказы",            Заказы);
	Запрос.УстановитьПараметр("НомераОтправлений", НомераОтправлений);
	Запрос.УстановитьПараметр("СведенияПоТоварам", СведенияПоТоварам);
	
	ПакетЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаОтгруженныхОтправлений = ПакетЗапроса[ПакетЗапроса.ВГраница() - 4].Выбрать();
	Пока ВыборкаОтгруженныхОтправлений.Следующий() Цикл
		НомераОтправленийЗаказа = Результат.НедоступныеКОтменеОтправления[ВыборкаОтгруженныхОтправлений.Заказ];
		Если НомераОтправленийЗаказа = Неопределено Тогда
			НомераОтправленийЗаказа = Новый Массив;
		КонецЕсли;
		НомераОтправленийЗаказа.Добавить(ВыборкаОтгруженныхОтправлений.НомерОтправления);
		Результат.НедоступныеКОтменеОтправления.Вставить(ВыборкаОтгруженныхОтправлений.Заказ, НомераОтправленийЗаказа);
		
		Индекс = НомераОтправлений.Найти(ВыборкаОтгруженныхОтправлений.НомерОтправления);
		Если Индекс <> Неопределено Тогда
			НомераОтправлений.Удалить(Индекс);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаДанныхПоЗаказам = ПакетЗапроса[ПакетЗапроса.ВГраница()].Выгрузить();
	
	ВыборкаНеотгруженныхОтправлений = ПакетЗапроса[ПакетЗапроса.ВГраница() - 3].Выбрать();
	Пока ВыборкаНеотгруженныхОтправлений.Следующий() Цикл
		НомераОтправленийЗаказа = Результат.НедоступныеКОтменеОтправления[ВыборкаНеотгруженныхОтправлений.Заказ];
		Если НомераОтправленийЗаказа = Неопределено Тогда
			НомераОтправленийЗаказа = Новый Массив;
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Заказ",          ВыборкаНеотгруженныхОтправлений.Заказ);
		Отбор.Вставить("Номенклатура",   ВыборкаНеотгруженныхОтправлений.Номенклатура);
		Отбор.Вставить("Характеристика", ВыборкаНеотгруженныхОтправлений.Характеристика);
		Отбор.Вставить("Склад",          ВыборкаНеотгруженныхОтправлений.Склад);
		Отбор.Вставить("Обработана",     Ложь);
		
		СтрокиЗаказа = ТаблицаДанныхПоЗаказам.НайтиСтроки(Отбор);
		Если СтрокиЗаказа.Количество() = 0 Тогда
			НомераОтправленийЗаказа.Добавить(ВыборкаНеотгруженныхОтправлений.НомерОтправления);
			
			Индекс = НомераОтправлений.Найти(ВыборкаНеотгруженныхОтправлений.НомерОтправления);
			Если Индекс <> Неопределено Тогда
				НомераОтправлений.Удалить(Индекс);
			КонецЕсли;
		Иначе
			СтрокаЗаказа = СтрокиЗаказа[0];
			
			Если ВыборкаНеотгруженныхОтправлений.Количество <= (СтрокаЗаказа.Зарезервировано - СтрокаЗаказа.ЗарезервированоОбработано) Тогда
				СтрокаЗаказа.ЗарезервированоОбработано   = СтрокаЗаказа.ЗарезервированоОбработано
															+ ВыборкаНеотгруженныхОтправлений.Количество;
			ИначеЕсли ВыборкаНеотгруженныхОтправлений.Количество <= (СтрокаЗаказа.КОтгрузкеНаСкладе -СтрокаЗаказа.КОтгрузкеНаСкладеОбработано) Тогда
				СтрокаЗаказа.КОтгрузкеНаСкладеОбработано = СтрокаЗаказа.КОтгрузкеНаСкладеОбработано
															+ ВыборкаНеотгруженныхОтправлений.Количество;
			Иначе
				НомераОтправленийЗаказа.Добавить(ВыборкаНеотгруженныхОтправлений.НомерОтправления);
				
				Индекс = НомераОтправлений.Найти(ВыборкаНеотгруженныхОтправлений.НомерОтправления);
				Если Индекс <> Неопределено Тогда
					НомераОтправлений.Удалить(Индекс);
				КонецЕсли;
			КонецЕсли;
			
			СтрокаЗаказа.Обработана = (СтрокаЗаказа.Зарезервировано = СтрокаЗаказа.ЗарезервированоОбработано
										И СтрокаЗаказа.КОтгрузкеНаСкладе = СтрокаЗаказа.КОтгрузкеНаСкладеОбработано);
		КонецЕсли;
		
		Если НомераОтправленийЗаказа.Количество() > 0 Тогда
			Результат.НедоступныеКОтменеОтправления.Вставить(ВыборкаНеотгруженныхОтправлений.Заказ, НомераОтправленийЗаказа);
		КонецЕсли;
	КонецЦикла;
	
	ШаблонСообщения1 = НСтр("ru = 'Для заказа ""%1"" недоступна отмена отправления %2, т.к. оно собрано на складе или отгружено. Для отмены исключите товары указанного отправления из складских документов и документов отгрузки.'");
	ШаблонСообщения2 = НСтр("ru = 'Для заказа ""%1"" недоступна отмена отправлений %2, т.к. они собраны на складе или отгружены. Для отмены исключите товары указанных отправлений из складских документов и документов отгрузки.'");
	
	Для Каждого ДанныеЗаказа Из Результат.НедоступныеКОтменеОтправления Цикл
		Если ДанныеЗаказа.Значение.Количество() = 1 Тогда
			Шаблон = ШаблонСообщения1;
		Иначе
			Шаблон = ШаблонСообщения2;
		КонецЕсли;
		
		СписокСообщений.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
										Шаблон,
										ДанныеЗаказа.Ключ,
										СтрСоединить(ДанныеЗаказа.Значение, ", ")));
	КонецЦикла;
	
	Результат.ИнформацияДляПользователя = СтрСоединить(СписокСообщений, Символы.ПС);
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПроверкиЗаказов(ЗаполнитьСведенияОбЭкземплярах = Ложь)

	ТекстЗапроса =
		"ВЫБРАТЬ
		|	СведенияПоТоварам.Заказ КАК Заказ,
		|	СведенияПоТоварам.ИдентификаторЭкземпляра КАК ИдентификаторЭкземпляра,
		|	СведенияПоТоварам.НомерОтправления КАК НомерОтправления,
		|	СведенияПоТоварам.ДокументОтгрузки КАК ДокументОтгрузки,
		|	СведенияПоТоварам.НомерРодительскогоОтправления КАК НомерРодительскогоОтправления,
		|	НЕ ЕСТЬNULL(ТоварыЗаказов.Отменено, ИСТИНА)
		|		И СведенияПоТоварам.ДокументОтгрузки <> НЕОПРЕДЕЛЕНО
		|		И СведенияПоТоварам.ИдентификаторСтроки = """" КАК ПозицияПеренесена,
		|	НЕ ЕСТЬNULL(ТоварыЗаказов.Отменено, ИСТИНА) КАК ПозицияКОтгрузке,
		|	СведенияПоТоварам.ИдентификаторСтроки = """" КАК НетПривязкиКОтгрузке,
		|	НЕ ЕСТЬNULL(ТоварыЗаказов.Отменено, ИСТИНА)
		|		И (СведенияПоТоварам.ДокументОтгрузки = НЕОПРЕДЕЛЕНО
		|			ИЛИ ВЫБОР
		|				КОГДА СведенияПоТоварам.ДокументОтгрузки ССЫЛКА Документ.ПередачаТоваровХранителю
		|					ТОГДА НЕ ВЫРАЗИТЬ(СведенияПоТоварам.ДокументОтгрузки КАК Документ.ПередачаТоваровХранителю).Проведен
		|				КОГДА СведенияПоТоварам.ДокументОтгрузки ССЫЛКА Документ.РеализацияТоваровУслуг
		|					ТОГДА НЕ ВЫРАЗИТЬ(СведенияПоТоварам.ДокументОтгрузки КАК Документ.РеализацияТоваровУслуг).Проведен
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ) КАК НетОтгрузки,
		|	ВЫБОР
		|		КОГДА СведенияПоТоварам.ТребуетсяСтранаПроисхождения
		|					И СведенияПоТоварам.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
		|				ИЛИ СведенияПоТоварам.ТребуетсяМаркировка
		|					И СведенияПоТоварам.ПолныйКодМаркировки = """"
		|				ИЛИ (СведенияПоТоварам.ТребуетсяНомерГТД
		|					ИЛИ СведенияПоТоварам.ТребуетсяРНПТ)
		|					И СведенияПоТоварам.НомерГТД = ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
		|				ИЛИ СведенияПоТоварам.ТребуетсяУИН
		|					И СведенияПоТоварам.УИН = """"
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТребуетсяЗаполнить
		|ПОМЕСТИТЬ СведенияПоТоварам
		|ИЗ
		|	РегистрСведений.ДополнительныеСведенияПоТоварамЗаказовТорговыхПлощадок КАК СведенияПоТоварам
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ТоварыЗаказов
		|		ПО СведенияПоТоварам.Заказ = ТоварыЗаказов.Ссылка
		|			И СведенияПоТоварам.КодСтроки = ТоварыЗаказов.КодСтроки
		|ГДЕ
		|	СведенияПоТоварам.Заказ В(&Заказы)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ,
		|	НомерОтправления";
	
	Если ЗаполнитьСведенияОбЭкземплярах Тогда
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов()
			+ "ВЫБРАТЬ
			  |	СведенияПоТоварам.Заказ КАК Заказ,
			  |	СведенияПоТоварам.ИдентификаторЭкземпляра КАК ИдентификаторЭкземпляра
			  |ИЗ
			  |	СведенияПоТоварам КАК СведенияПоТоварам
			  |ГДЕ
			  |	СведенияПоТоварам.НетОтгрузки
			  |ИТОГИ ПО
			  |	Заказ";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов()
		+ "ВЫБРАТЬ
		  |	ЗаказыТорговыхПлощадок.Заказ КАК Заказ,
		  |	ЗаказыТорговыхПлощадок.УчетнаяЗапись КАК УчетнаяЗапись,
		  |	ЗаказыТорговыхПлощадок.НомерОтправления КАК НомерОтправления,
		  |	МИНИМУМ(ЗаказыТорговыхПлощадок.ДокументОтгрузки) КАК ДокументОтгрузки,
		  |	МИНИМУМ(ЗаказыТорговыхПлощадок.НомерРодительскогоОтправления) КАК НомерРодительскогоОтправления,
		  |	МИНИМУМ(ЗаказыТорговыхПлощадок.Статус) КАК Статус,
		  |	ЕСТЬNULL(МАКСИМУМ(СведенияПоТоварам.ИдентификаторЭкземпляра), 0) КАК МаксимальныйИдентификаторЭкземпляра,
		  |	ЕСТЬNULL(МАКСИМУМ(ЗаказыТорговыхПлощадок.ДокументОтгрузки <> НЕОПРЕДЕЛЕНО
		  |				И (СведенияПоТоварам.Заказ ЕСТЬ NULL
		  |					ИЛИ СведенияПоТоварам.ПозицияКОтгрузке
		  |						И (СведенияПоТоварам.НетПривязкиКОтгрузке
		  |							ИЛИ СведенияПоТоварам.ДокументОтгрузки <> ЗаказыТорговыхПлощадок.ДокументОтгрузки))), ИСТИНА) КАК ЕстьРасхождения,
		  |	ЕСТЬNULL(СУММА(ВЫБОР
		  |				КОГДА СведенияПоТоварам.Заказ ЕСТЬ NULL
		  |					ТОГДА 0
		  |				КОГДА НЕ СведенияПоТоварам.НетПривязкиКОтгрузке
		  |					ТОГДА 0
		  |				КОГДА НЕ СведенияПоТоварам.ПозицияПеренесена
		  |					ТОГДА 0
		  |				ИНАЧЕ ВЫРАЗИТЬ(1 КАК ЧИСЛО(17, 0))
		  |			КОНЕЦ), 1) КАК КоличествоПеренесенныхПозиций,
		  |	ЕСТЬNULL(СУММА(ВЫБОР
		  |				КОГДА СведенияПоТоварам.Заказ ЕСТЬ NULL
		  |					ТОГДА 0
		  |				ИНАЧЕ ВЫРАЗИТЬ(1 КАК ЧИСЛО(17, 0))
		  |			КОНЕЦ), 0) КАК КоличествоЗаписей
		  |ПОМЕСТИТЬ ОтправленияПоЗаказам
		  |ИЗ
		  |	РегистрСведений.ЗаказыТорговыхПлощадок КАК ЗаказыТорговыхПлощадок
		  |		ЛЕВОЕ СОЕДИНЕНИЕ СведенияПоТоварам КАК СведенияПоТоварам
		  |		ПО ЗаказыТорговыхПлощадок.Заказ = СведенияПоТоварам.Заказ
		  |			И ЗаказыТорговыхПлощадок.НомерОтправления = СведенияПоТоварам.НомерОтправления
		  |ГДЕ
		  |	ЗаказыТорговыхПлощадок.Заказ В(&Заказы)
		  |
		  |СГРУППИРОВАТЬ ПО
		  |	ЗаказыТорговыхПлощадок.Заказ,
		  |	ЗаказыТорговыхПлощадок.УчетнаяЗапись,
		  |	ЗаказыТорговыхПлощадок.НомерОтправления
		  |
		  |ИНДЕКСИРОВАТЬ ПО
		  |	Заказ,
		  |	НомерОтправления
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |ВЫБРАТЬ РАЗЛИЧНЫЕ
		  |	ЗаказыТорговыхПлощадок.Заказ КАК Заказ,
		  |	ЗаказыТорговыхПлощадок.УчетнаяЗапись КАК УчетнаяЗапись
		  |ПОМЕСТИТЬ ЗаказыТорговыхПлощадок
		  |ИЗ
		  |	ОтправленияПоЗаказам КАК ЗаказыТорговыхПлощадок
		  |
		  |ИНДЕКСИРОВАТЬ ПО
		  |	Заказ
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |ВЫБРАТЬ
		  |	1 КАК Порядок,
		  |	ОтправленияПоЗаказам.Заказ КАК Заказ,
		  |	ОтправленияПоЗаказам.Заказ.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		  |	ОтправленияПоЗаказам.УчетнаяЗапись КАК УчетнаяЗапись,
		  |	ОтправленияПоЗаказам.УчетнаяЗапись.ВидМаркетплейса КАК ВидМаркетплейса,
		  |	ОтправленияПоЗаказам.НомерОтправления КАК НомерОтправления,
		  |	ОтправленияПоЗаказам.НомерРодительскогоОтправления КАК НомерРодительскогоОтправления,
		  |	ОтправленияПоЗаказам.ДокументОтгрузки КАК ДокументОтгрузки,
		  |	ВЫБОР
		  |		КОГДА ОтправленияПоЗаказам.ДокументОтгрузки ССЫЛКА Документ.ПередачаТоваровХранителю
		  |			ТОГДА ВЫРАЗИТЬ(ОтправленияПоЗаказам.ДокументОтгрузки КАК Документ.ПередачаТоваровХранителю).Номер
		  |		КОГДА ОтправленияПоЗаказам.ДокументОтгрузки ССЫЛКА Документ.РеализацияТоваровУслуг
		  |			ТОГДА ВЫРАЗИТЬ(ОтправленияПоЗаказам.ДокументОтгрузки КАК Документ.РеализацияТоваровУслуг).Номер
		  |		ИНАЧЕ """"
		  |	КОНЕЦ КАК НомерДокументаОтгрузки,
		  |	ВЫБОР
		  |		КОГДА ОтправленияПоЗаказам.ДокументОтгрузки ССЫЛКА Документ.ПередачаТоваровХранителю
		  |			ТОГДА ВЫРАЗИТЬ(ОтправленияПоЗаказам.ДокументОтгрузки КАК Документ.ПередачаТоваровХранителю).Дата
		  |		КОГДА ОтправленияПоЗаказам.ДокументОтгрузки ССЫЛКА Документ.РеализацияТоваровУслуг
		  |			ТОГДА ВЫРАЗИТЬ(ОтправленияПоЗаказам.ДокументОтгрузки КАК Документ.РеализацияТоваровУслуг).Дата
		  |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		  |	КОНЕЦ КАК ДатаДокументаОтгрузки,
		  |	ОтправленияПоЗаказам.Статус КАК Статус,
		  |	ОтправленияПоЗаказам.МаксимальныйИдентификаторЭкземпляра КАК МаксимальныйИдентификаторЭкземпляра,
		  |	ОтправленияПоЗаказам.КоличествоПеренесенныхПозиций КАК КоличествоПеренесенныхПозиций,
		  |	ОтправленияПоЗаказам.КоличествоЗаписей КАК КоличествоЗаписей
		  |ИЗ
		  |	ОтправленияПоЗаказам КАК ОтправленияПоЗаказам
		  |
		  |ОБЪЕДИНИТЬ ВСЕ
		  |
		  |ВЫБРАТЬ
		  |	2,
		  |	СведенияПоТоварам.Заказ,
		  |	СведенияПоТоварам.Заказ.ХозяйственнаяОперация,
		  |	ЕСТЬNULL(МАКСИМУМ(ЗаказыТорговыхПлощадок.УчетнаяЗапись), ЗНАЧЕНИЕ(Справочник.УчетныеЗаписиМаркетплейсов.ПустаяСсылка)),
		  |	ЕСТЬNULL(МАКСИМУМ(ЗаказыТорговыхПлощадок.УчетнаяЗапись.ВидМаркетплейса), ЗНАЧЕНИЕ(Перечисление.ВидыМаркетплейсов.ПустаяСсылка)),
		  |	СведенияПоТоварам.НомерОтправления,
		  |	СведенияПоТоварам.НомерРодительскогоОтправления,
		  |	НЕОПРЕДЕЛЕНО,
		  |	"""",
		  |	ДАТАВРЕМЯ(1, 1, 1),
		  |	ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовТорговыхПлощадок.ОжидаетСборки),
		  |	МАКСИМУМ(СведенияПоТоварам.ИдентификаторЭкземпляра),
		  |	СУММА(ВЫБОР
		  |			КОГДА СведенияПоТоварам.НомерРодительскогоОтправления = """"
		  |				ТОГДА 0
		  |			КОГДА СведенияПоТоварам.ДокументОтгрузки <> НЕОПРЕДЕЛЕНО
		  |				ТОГДА ВЫРАЗИТЬ(1 КАК ЧИСЛО(17, 0))
		  |			ИНАЧЕ 0
		  |		КОНЕЦ),
		  |	СУММА(ВЫРАЗИТЬ(1 КАК ЧИСЛО(17, 0)))
		  |ИЗ
		  |	СведенияПоТоварам КАК СведенияПоТоварам
		  |		ЛЕВОЕ СОЕДИНЕНИЕ ОтправленияПоЗаказам КАК ОтправленияПоЗаказам
		  |		ПО СведенияПоТоварам.Заказ = ОтправленияПоЗаказам.Заказ
		  |			И СведенияПоТоварам.НомерОтправления = ОтправленияПоЗаказам.НомерОтправления
		  |		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказыТорговыхПлощадок КАК ЗаказыТорговыхПлощадок
		  |		ПО СведенияПоТоварам.Заказ = ЗаказыТорговыхПлощадок.Заказ
		  |ГДЕ
		  |	ОтправленияПоЗаказам.НомерОтправления ЕСТЬ NULL
		  |
		  |СГРУППИРОВАТЬ ПО
		  |	СведенияПоТоварам.Заказ,
		  |	СведенияПоТоварам.НомерОтправления,
		  |	СведенияПоТоварам.НомерРодительскогоОтправления,
		  |	СведенияПоТоварам.Заказ.ХозяйственнаяОперация
		  |
		  |УПОРЯДОЧИТЬ ПО
		  |	НомерОтправления
		  |ИТОГИ
		  |	МАКСИМУМ(ХозяйственнаяОперация),
		  |	МАКСИМУМ(УчетнаяЗапись),
		  |	МАКСИМУМ(ВидМаркетплейса)
		  |ПО
		  |	Заказ
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |УНИЧТОЖИТЬ ЗаказыТорговыхПлощадок
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |ВЫБРАТЬ РАЗЛИЧНЫЕ
		  |	ИзмененныеОтправления.Порядок КАК Порядок,
		  |	ИзмененныеОтправления.Заказ КАК Заказ,
		  |	ИзмененныеОтправления.НомерОтправления КАК НомерОтправления,
		  |	ИзмененныеОтправления.ДокументОтгрузки КАК ДокументОтгрузки
		  |ИЗ
		  |	(ВЫБРАТЬ
		  |		1 КАК Порядок,
		  |		СведенияПоТоварам.Заказ КАК Заказ,
		  |		СведенияПоТоварам.НомерОтправления КАК НомерОтправления,
		  |		ЕСТЬNULL(ОтправленияПоЗаказам.ДокументОтгрузки, НЕОПРЕДЕЛЕНО) КАК ДокументОтгрузки
		  |	ИЗ
		  |		СведенияПоТоварам КАК СведенияПоТоварам
		  |			ЛЕВОЕ СОЕДИНЕНИЕ ОтправленияПоЗаказам КАК ОтправленияПоЗаказам
		  |			ПО СведенияПоТоварам.Заказ = ОтправленияПоЗаказам.Заказ
		  |				И СведенияПоТоварам.НомерОтправления = ОтправленияПоЗаказам.НомерОтправления
		  |	ГДЕ
		  |		СведенияПоТоварам.ПозицияПеренесена
		  |		И ОтправленияПоЗаказам.ДокументОтгрузки ЕСТЬ NULL
		  |	
		  |	ОБЪЕДИНИТЬ ВСЕ
		  |	
		  |	ВЫБРАТЬ РАЗЛИЧНЫЕ
		  |		2,
		  |		СведенияПоТоварам.Заказ,
		  |		ЕСТЬNULL(ОтправленияПоЗаказам.НомерОтправления, """"),
		  |		СведенияПоТоварам.ДокументОтгрузки
		  |	ИЗ
		  |		СведенияПоТоварам КАК СведенияПоТоварам
		  |			ЛЕВОЕ СОЕДИНЕНИЕ ОтправленияПоЗаказам КАК ОтправленияПоЗаказам
		  |			ПО СведенияПоТоварам.Заказ = ОтправленияПоЗаказам.Заказ
		  |				И СведенияПоТоварам.ДокументОтгрузки = ОтправленияПоЗаказам.ДокументОтгрузки
		  |	ГДЕ
		  |		СведенияПоТоварам.ПозицияПеренесена
		  |		И СведенияПоТоварам.НомерОтправления <> ОтправленияПоЗаказам.НомерОтправления
		  |		И ОтправленияПоЗаказам.ДокументОтгрузки ЕСТЬ НЕ NULL 
		  |	
		  |	ОБЪЕДИНИТЬ ВСЕ
		  |	
		  |	ВЫБРАТЬ РАЗЛИЧНЫЕ
		  |		3,
		  |		ОтправленияПоЗаказам.Заказ,
		  |		ОтправленияПоЗаказам.НомерОтправления,
		  |		ОтправленияПоЗаказам.ДокументОтгрузки
		  |	ИЗ
		  |		ОтправленияПоЗаказам КАК ОтправленияПоЗаказам
		  |	ГДЕ
		  |		ОтправленияПоЗаказам.ЕстьРасхождения) КАК ИзмененныеОтправления
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |УНИЧТОЖИТЬ ОтправленияПоЗаказам
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |ВЫБРАТЬ РАЗЛИЧНЫЕ
		  |	СведенияПоТоварам.Заказ КАК Заказ,
		  |	СведенияПоТоварам.НомерОтправления КАК НомерОтправления
		  |ИЗ
		  |	СведенияПоТоварам КАК СведенияПоТоварам
		  |ГДЕ
		  |	СведенияПоТоварам.ТребуетсяЗаполнить
		  |	И СведенияПоТоварам.ПозицияКОтгрузке";
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов()
		+ "УНИЧТОЖИТЬ СведенияПоТоварам";
	
	Возврат ТекстЗапроса;

КонецФункции

Процедура ПроверитьГотовностьОтправленийКПодтверждениюСборки(РезультатПроверкиЗаказа)

	ДетализацияПроблемПоОтправлениям = Новый Соответствие;
	
	Для Каждого ЗаписьИзДанныхПоНомерамОтправлений Из РезультатПроверкиЗаказа.ДанныеПоНомерамОтправлений Цикл
		НомерОтправления = ЗаписьИзДанныхПоНомерамОтправлений.Ключ;
		
		ВСборке = (РезультатПроверкиЗаказа.ОтправленияНеВСборке.Найти(НомерОтправления) = Неопределено);
		ЕстьТовары = (РезультатПроверкиЗаказа.ОтправленияБезТоваров.Найти(НомерОтправления) = Неопределено);
		ЕстьНеЗаполненыеДанные = (РезультатПроверкиЗаказа.ОтправленияСНезаполненнымиДанными.Найти(НомерОтправления) <> Неопределено);
		ЕстьДокументОтгрузки = (РезультатПроверкиЗаказа.ОтправленияБезДокументовОтгрузки.Найти(НомерОтправления) = Неопределено);
		ИзмененДокументОтгрузки = (РезультатПроверкиЗаказа.ОтправленияИзмененные.Найти(НомерОтправления) <> Неопределено);
		
		Если ВСборке И ЕстьТовары И Не ЕстьНеЗаполненыеДанные
				И ЕстьДокументОтгрузки И Не ИзмененДокументОтгрузки Тогда
			РезультатПроверкиЗаказа.ОтправленияКПодтверждениюСборки.Добавить(НомерОтправления);
		Иначе
			Проблемы = Новый Массив;
			
			Если Не ВСборке Тогда
				Проблемы.Добавить(НСтр("ru = 'Сборка отправления не требуется.'"));
			ИначеЕсли Не ЕстьТовары Тогда
				Проблемы.Добавить(НСтр("ru = 'Не найдены товары отправления.'"));
			Иначе
				Если ЕстьНеЗаполненыеДанные Тогда
					Проблемы.Добавить(НСтр("ru = 'Есть незаполненные данные по товарам отправления.'"));
				КонецЕсли;
				
				Если Не ЕстьДокументОтгрузки Или ИзмененДокументОтгрузки Тогда
					Проблемы.Добавить(НСтр("ru = 'Требуется оформление документа отгрузки.'"));
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Проблемы) Тогда
				ДетализацияПроблемПоОтправлениям.Вставить(НомерОтправления, Проблемы);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	РезультатПроверкиЗаказа.ДетализацияПроблемПоОтправлениям = ДетализацияПроблемПоОтправлениям;

КонецПроцедуры


#КонецОбласти

#КонецЕсли
